In [1]:
import pandas as pd

In [2]:
'l1 l2 l3 l4' .split()

['l1', 'l2', 'l3']

In [6]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        ( 9, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4' .split(), 'c1 c2 c3 c4' .split())

In [7]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [8]:
df ['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [9]:
type(df ['c1'])

pandas.core.series.Series

In [11]:
df [['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [13]:
type(df [['c3', 'c1']])

pandas.core.frame.DataFrame

In [16]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [17]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   9
l4  15  13

In [19]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [20]:
df.loc[['l3','l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [21]:
df.loc['l1', 'c2']

2

In [22]:
df.iloc[0,1]

2

In [23]:
df.loc[['l3','l1'], ['c4', 'c1']]

    c4  c1
l3  12   9
l1   4   1

In [24]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [25]:
df.iloc[[2,0], [3,0]]

    c4  c1
l3  12   9
l1   4   1